src/cf/Catalogs/пбп_НастройкиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>пбп_НастройкиИнтеграции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтегрируемаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтегрируемыеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ТипыИнтеграций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.пбп_УчетныеЗаписиЭлектроннойПочты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_ТипыАвторизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПользовательскиеФункции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяCOMОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмененВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаВнешнейКомпоненты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяКомпонента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/пбп_НастройкиИнтеграции/Ext/ObjectModule.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций
		.ПолучитьПредопределенныйЭлементНаследованияНастроекТипаИнтеграции(ТипИнтеграции);
	
	Если ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций.COM
		Или ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций.КоманднаяСтрока
		Или ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций.ПочтовыйКлиент Тогда
		НепроверяемыеРеквизиты.Добавить("СтрокаПодключения");
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из НепроверяемыеРеквизиты Цикл
	
		ПорядковыйНомер = ПроверяемыеРеквизиты.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПорядковыйНомер);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций
		.ПолучитьПредопределенныйЭлементНаследованияНастроекТипаИнтеграции(ТипИнтеграции);
	Если ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций.Каталог Тогда
		Порт				= "";
		ВнешняяКомпонента	= Неопределено;
		УчетнаяЗапись		= Неопределено;
		ТипАвторизации		= Перечисления.пбп_ТипыАвторизации.ПустаяСсылка();
		ИмяCOMОбъекта		= "";
		ИмяФайлаВнешнейКомпоненты = "";
	ИначеЕсли ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций.FTPРесурсы Тогда
		ВнешняяКомпонента	= Неопределено;
		УчетнаяЗапись		= Неопределено;
		ТипАвторизации		= Перечисления.пбп_ТипыАвторизации.ПустаяСсылка();
		ИмяCOMОбъекта		= "";
		ИмяФайлаВнешнейКомпоненты = "";
	ИначеЕсли ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций.ПочтовыйКлиент Тогда
		СтрокаПодключения	= "";
		Порт				= "";
		ВнешняяКомпонента	= Неопределено;
		ТипАвторизации		= Перечисления.пбп_ТипыАвторизации.ПустаяСсылка();
		ИмяCOMОбъекта		= "";
		ИмяФайлаВнешнейКомпоненты = "";
	ИначеЕсли ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций.COM Тогда
		Порт				= "";
		ВнешняяКомпонента	= Неопределено;
		УчетнаяЗапись		= Неопределено;
		ТипАвторизации		= Перечисления.пбп_ТипыАвторизации.ПустаяСсылка();
		ИспользоватьПользовательскиеФункции = Ложь;
		ИмяФайлаВнешнейКомпоненты = "";
	ИначеЕсли ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций.RESTAPI Тогда
		ВнешняяКомпонента	= Неопределено;
		УчетнаяЗапись		= Неопределено;
		ИмяCOMОбъекта		= Неопределено;
		ИспользоватьПользовательскиеФункции = Ложь;
		ИмяФайлаВнешнейКомпоненты = "";
	ИначеЕсли ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций.SOAP Тогда
		ВнешняяКомпонента	= Неопределено;
		УчетнаяЗапись		= Неопределено;
		ИмяCOMОбъекта		= Неопределено;
		ИспользоватьПользовательскиеФункции = Ложь;
		ИмяФайлаВнешнейКомпоненты = "";
	ИначеЕсли ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций.ВнешняяКомпонента Тогда
		УчетнаяЗапись		= Неопределено;
		ИмяCOMОбъекта		= Неопределено;
		ТипАвторизации		= Перечисления.пбп_ТипыАвторизации.ПустаяСсылка();
		ИспользоватьПользовательскиеФункции = Ложь;
	ИначеЕсли ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций.КоманднаяСтрока Тогда
		Порт				= "";
		ВнешняяКомпонента	= Неопределено;
		УчетнаяЗапись		= Неопределено;
		ТипАвторизации		= Перечисления.пбп_ТипыАвторизации.ПустаяСсылка();
		ИспользоватьПользовательскиеФункции = Ложь;
		ИмяФайлаВнешнейКомпоненты = "";
	ИначеЕсли ЭлементНаследованиия = Справочники.пбп_ТипыИнтеграций.БрокерыСообщений Тогда
		УчетнаяЗапись		= Неопределено;
		ИмяCOMОбъекта		= Неопределено;
		ИспользоватьПользовательскиеФункции = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
